<a href="https://colab.research.google.com/github/Berenice2018/DeepLearning/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Notes about Pandas**

In [0]:
import numpy as np
import pandas as pd

# Creating pandas Series

A Pandas series is a one-dimensional array-like object that can hold many data types

| Pandas Series | NumPy ndarray |
| --- | --- | 
| you can assign an index label to each element | cannot | 
| can hold data of different data types | cannot |
| data is not indexed with the label names |  indexed with numbers

In [2]:
# create a Pandas Series that stores a grocery list
groceries = pd.Series(data = [30, 6, 'Yes', 'No'], index = ['eggs', 'apples', 'milk', 'bread'])

# We display the Groceries Pandas Series
print(groceries)

print('\nGroceries has shape:', groceries.shape)
print('Groceries has dimension:', groceries.ndim)
print('Groceries has a total of', groceries.size, 'elements')

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

Groceries has shape: (4,)
Groceries has dimension: 1
Groceries has a total of 4 elements

In [3]:
# print the index and data of the series
print('The data in Groceries is:', groceries.values)
print('The index of Groceries is:', groceries.index)

The data in Groceries is: [30 6 'Yes' 'No']
The index of Groceries is: Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [4]:
# Check if a label exists in the series
x = 'apples' in groceries
y = 'elephant' in groceries
print(x, y)

True False

# Accessing and Deleting Elements in pandas Series

The attribute *.loc* stands for location, it states that we are using a **labeled** index. 

The attribute .*iloc* stands for integer location, it states that we are using a **numerical** index.

In [5]:
# single index label
print('How many eggs do we need to buy:', groceries['eggs'])
# access multiple index labels
print('Do we need milk and bread:\n', groceries[['milk', 'bread']]) 
# use loc to access multiple index labels
print('How many eggs and apples do we need to buy:\n', groceries.loc[['eggs', 'apples']]) 
print()

# use multiple numerical indices
print('How many eggs and apples do we need to buy:\n',  groceries[[0, 1]]) 
# use a negative numerical index
print('Do we need bread:\n', groceries[[-1]]) 
# use a single numerical index
print('How many eggs do we need to buy:', groceries[0]) 
# access multiple numerical indices
print('Do we need milk and bread:\n', groceries.iloc[[2, 3]])

How many eggs do we need to buy: 30
Do we need milk and bread:
 milk     Yes
bread     No
dtype: object
How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object

How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object
Do we need bread:
 bread    No
dtype: object
How many eggs do we need to buy: 30
Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

The `Series.drop(label)`  method drops elements from the Series out of place, it doesn't change the original Series being modified

Delete items from a Pandas Series in place by setting the keyword  `inplace` to `True` in the `.drop()`

In [6]:
print('Original Grocery List:\n', groceries)

# remove apples from our grocery list. The drop function removes elements out of place
print('\nWe remove apples (out of place):\n', groceries.drop('apples'))

print('\nOriginal grocery List after removing apples out of place:\n', groceries)

groceries.drop(['apples', 'eggs'], inplace = True)
print('\nRemoved apples and eggs in place:\n', groceries )

Original Grocery List:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

We remove apples (out of place):
 eggs      30
milk     Yes
bread     No
dtype: object

Original grocery List after removing apples out of place:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

Removed apples and eggs in place:
 milk     Yes
bread     No
dtype: object

# Arithmetic operations

In [7]:
# a Pandas Series that stores a grocery list of just fruits
fruits= pd.Series(data = [10, 6, 3,], index = ['apples', 'oranges', 'bananas'])

fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [8]:
# apply arithmetic operations to each item in fruits
print('fruits + 2:\n', fruits + 2)
print('\nfruits - 2:\n', fruits - 2)
print('\nfruits * 2:\n', fruits * 2) 
print('\nfruits / 2:\n', fruits / 2) # results in dtype float64

fruits + 2:
 apples     12
oranges     8
bananas     5
dtype: int64

fruits - 2:
 apples     8
oranges    4
bananas    1
dtype: int64

fruits * 2:
 apples     20
oranges    12
bananas     6
dtype: int64

fruits / 2:
 apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [9]:
# apply different mathematical functions to all elements of fruits
print('\nEXP(X) = \n', np.exp(fruits))
print('\nSQRT(X) =\n', np.sqrt(fruits))
print('\nPOW(X,2) =\n',np.power(fruits,2)) # raise to the power of 2

EXP(X) =
 apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

SQRT(X) =
 apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

POW(X,2) =
 apples     100
oranges     36
bananas      9
dtype: int64

Apply arithmetic operations on Pandas Series of mixed data type provided that the **arithmetic operation is defined for all data types** in the Series

When you have mixed data types in your Pandas Series make sure the arithmetic operations are valid on all the data types of your elements.

In [10]:
series2 = pd.Series([100], index=['cherries'])

print(groceries.append(series2) *2)
print()
groceries * 2

milk        YesYes
bread         NoNo
cherries       200
dtype: object

milk     YesYes
bread      NoNo
dtype: object

In [11]:
# Create a Pandas Series that contains the distance of some planets from the Sun.
# Use the name of the planets as the index to your Pandas Series, and the distance
# from the Sun as your data. The distance from the Sun is in units of 10^6 km

distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]

planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter'] 

# Create a Pandas Series using the above data, with the name of the planets as
# the index and the distance from the Sun as your data.
dist_planets = pd.Series(data = distance_from_sun, index = planets)
print(dist_planets)

# Calculate the number of minutes it takes sunlight to reach each planet. You can
# do this by dividing the distance from the Sun for each planet by the speed of light.
# Since in the data above the distance from the Sun is in units of 10^6 km, you can
# use a value for the speed of light of c = 18, since light travels 18 x 10^6 km/minute.
time_light = dist_planets / 18
print('\ntime_light:\n', time_light)

# Use Boolean indexing to select only those planets for which sunlight takes less
# than 40 minutes to reach them.
close_planets = time_light[time_light < 40] 
print('\nclose_planets:\n', close_planets)

Earth       149.6
Saturn     1433.5
Mars        227.9
Venus       108.2
Jupiter     778.6
dtype: float64

time_light:
 Earth       8.311111
Saturn     79.638889
Mars       12.661111
Venus       6.011111
Jupiter    43.255556
dtype: float64

close_planets:
 Earth     8.311111
Mars     12.661111
Venus     6.011111
dtype: float64

# Creating Pandas DataFrames

Pandas DataFrames are 2-dimensional data structures with labeled rows and columns, that can hold many data types. (Like an Excel spreadsheet)

Create Pandas DataFrames manually or by loading data from a file.

In [12]:

# create a dictionary of Pandas Series 
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

# print the type of items to see that it is a dictionary
print(type(items))


# create a Pandas DataFrame by passing it a dictionary of Pandas Series
shopping_carts = pd.DataFrame(items)

shopping_carts

<class 'dict'>

         Alice    Bob
bike     500.0  245.0
book      40.0    NaN
glasses  110.0    NaN
pants     45.0   25.0
watch      NaN   55.0

So whenever a DataFrame is created, if a particular column doesn't have values for a particular row index, Pandas will put a NaN value there. 

If we were to feed this data into a machine learning algorithm we will have to remove these NaN values first.

If we don't provide index labels to the Pandas Series, Pandas will use numerical row indexes when it creates the DataFrame:
Example:

In [13]:
# Create a dictionary of Pandas Series without indices
data = {'Bob' : pd.Series([245, 25, 55]),
        'Alice' : pd.Series([40, 110, 500, 45])}

# create a DataFrame
df = pd.DataFrame(data)
df

   Alice    Bob
0     40  245.0
1    110   25.0
2    500   55.0
3     45    NaN

In [14]:
# print some information about shopping_carts
print('shopping_carts has shape:', shopping_carts.shape)
print('shopping_carts has dimension:', shopping_carts.ndim)
print('shopping_carts has a total of:', shopping_carts.size, 'elements')
print()
print('The values in shopping_carts is:\n', shopping_carts.values)
print()
print('The row indices in shopping_carts are:', shopping_carts.index)
print()
print('The column index in shopping_carts is:', shopping_carts.columns)

shopping_carts has shape: (5, 2)
shopping_carts has dimension: 2
shopping_carts has a total of: 10 elements

The values in shopping_carts is:
 [[500. 245.]
 [ 40.  nan]
 [110.  nan]
 [ 45.  25.]
 [ nan  55.]]

The row indices in shopping_carts are: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

The column index in shopping_carts is: Index(['Alice', 'Bob'], dtype='object')

Select which data we want to put into our DataFrame by means of the keywords columns and index

In [15]:
# Create a DataFrame that only has Bob's data
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
print(bob_shopping_cart)


# Create a DataFrame that only has selected items for both Alice and Bob
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])
print('\n', sel_shopping_cart)

# Create a DataFrame that only has selected items for Alice
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])
alice_sel_shopping_cart

       Bob
bike   245
pants   25
watch   55

        Alice   Bob
pants     45  25.0
book      40   NaN

         Alice
glasses    110
bike       500

Create DataFrames **from a dictionary of lists** (arrays). 
All the lists (arrays) in the dictionary must be of the same length.

In [16]:
# create a dictionary of lists (arrays)
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

# create a DataFrame and provide the row index
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])
df

         Floats  Integers
label 1     4.5         1
label 2     8.2         2
label 3     9.6         3

**using a list of Python dictionaries**

In [17]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# create a DataFrame 
# store_items = pd.DataFrame(items2)
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

# Accessing elements in DataFrames

Access rows, columns, or individual elements of the DataFrame by using the row and column labels

In [18]:
print(store_items)

# access rows, columns and elements using labels
print()
print('How many bikes are in each store:\n', store_items[['bikes']])
print()
print('How many bikes and pants are in each store?\n', store_items[['pants', 'bikes']])
print()
print('What items are in Store 1?\n', store_items.loc[['store 1']])
print()
print('How many bikes are in Store 2?', store_items['bikes']['store 2']) # dataframe[column][row]

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

How many bikes are in each store:
          bikes
store 1     20
store 2     15

How many bikes and pants are in each store?
          pants  bikes
store 1     30     20
store 2      5     15

What items are in Store 1?
          bikes  glasses  pants  watches
store 1     20      NaN     30       35

How many bikes are in Store 2? 15

add new columns to  DataFrames

In [19]:
# add a new column named shirts to store_items DataFrame indicating the number of
# shirts in stock at each store. We will put 15 shirts in store 1 and 2 shirts in store 2
store_items['shirts'] = [15,2]
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

add new columns to our DataFrame by using arithmetic operations between other columns

In [20]:
# make a new column called suits by adding the number of shirts and pants
store_items['suits'] = store_items['pants'] + store_items['shirts']
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

Suppose now, that you opened a new store and you need to add the number of items in stock of that new store into your DataFrame. 

We can do this by adding a new row to the `store_items` Dataframe. 

To add rows to our DataFrame we first have to create a new Dataframe and then append it to the original DataFrame. 

By appending a new row to the DataFrame, the columns will be put in alphabetical order.

In [21]:
# create a dictionary from a list of Python dictionaries that will number of items at the new store
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# create a new DataFrame with the new_items and provide and index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])
#new_store

# append store 3 to our store_items DataFrame
store_items = store_items.append(new_store)
store_items

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    15.0   45.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

Add new columns of our DataFrame by using only data from particular rows in particular columns. 

For example, suppose that you want to stock stores 2 and 3 with new watches and you want the quantity of the new watches to be the same as the watches already in stock for those stores

In [22]:
# add a new column using data from particular rows in the watches column
store_items['new watches'] = store_items['watches'][1:]
store_items

         bikes  glasses  pants  shirts  suits  watches  new watches
store 1     20      NaN     30    15.0   45.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

 `dataframe.insert(loc,label,data) `method allows us to insert a new column in the dataframe at location loc, with the given column label, and given data

In [23]:
# insert a new column with label shoes right before the column with numerical index 4
store_items.insert(4, 'shoes', [8,5,0])
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches  new watches
store 1     20      NaN     30    15.0      8   45.0       35          NaN
store 2     15     50.0      5     2.0      5    7.0       10         10.0
store 3     20      4.0     30     NaN      0    NaN       35         35.0

To delete rows and columns from our DataFrame we will use the `.pop() `and` .drop()` methods. 

`.pop()`:  delete columns
`.drop()` delete both rows and columns by use of the axis keyword.

In [27]:
# remove the new watches column
store_items.pop('new watches')
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN      0    NaN       35

In [28]:
# remove columns
store_items = store_items.drop(['watches', 'shoes'], axis = 1)
#store_items

# remove rows
store_items = store_items.drop(['store 2', 'store 1'], axis = 0)

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits
store 3     20      4.0     30     NaN    NaN

change the row and column labels

In [31]:
# change the column label bikes to hats
store_items = store_items.rename(columns = {'bikes': 'hats'})

store_items = store_items.rename(index = {'store 3': 'last store'})

# we display the modified DataFrame
store_items

            hats  glasses  pants  shirts  suits
last store    20      4.0     30     NaN    NaN

In [32]:
# We change the row index to be the data in the pants column
store_items = store_items.set_index('pants')

# we display the modified DataFrame
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN